/* Задача(сложная не на оценку) 
Напишите программу, которая находит подмножество данного множества чисел такое, 
что сумма его элементов равна заданному числу  */





















/*
void miniSumArray(int number)
{
    for (int i = 0; i <= number / 2 - 1; i++)
    {
        int first = i + 1;
        int second = number - 1 - i;
        if(first != second && first + second == number)
        {
        Console.Write($"{first} ; {second}");
        Console.WriteLine();
        }
        //miniSumArray(first);
        //miniSumArray(second);
        
    }
}
miniSumArray(5);
*/